MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19155/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0x1D2C);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 01D2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C3                  :1;
        unsigned S19C3                  :1;
        unsigned S20C3                  :1;
        unsigned                        :1;
        unsigned S22C3                  :1;
        unsigned S23C3                  :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0x1D2C);
// bitfield macros
#define _LCDDATA20_S18C3_POSN                               0x2
#define _LCDDATA20_S18C3_POSITION                           0x2
#define _LCDDATA20_S18C3_SIZE                               0x1
#define _LCDDATA20_S18C3_LENGTH                             0x1
#define _LCDDATA20_S18C3_MASK                               0x4
#define _LCDDATA20_S19C3_POSN                               0x3
#define _LCDDATA20_S19C3_POSITION                           0x3
#define _LCDDATA20_S19C3_SIZE                               0x1
#define _LCDDATA20_S19C3_LENGTH                             0x1
#define _LCDDATA20_S19C3_MASK                               0x8
#define _LCDDATA20_S20C3_POSN                               0x4
#define _LCDDATA20_S20C3_POSITION                           0x4
#define _LCDDATA20_S20C3_SIZE                               0x1
#define _LCDDATA20_S20C3_LENGTH                             0x1
#define _LCDDATA20_S20C3_MASK                               0x10
#define _LCDDATA20_S22C3_POSN                               0x6
#define _LCDDATA20_S22C3_POSITION                           0x6
#define _LCDDATA20_S22C3_SIZE                               0x1
#define _LCDDATA20_S22C3_LENGTH                             0x1
#define _LCDDATA20_S22C3_MASK                               0x40
#define _LCDDATA20_S23C3_POSN                               0x7
#define _LCDDATA20_S23C3_POSITION                           0x7
#define _LCDDATA20_S23C3_SIZE                               0x1
#define _LCDDATA20_S23C3_LENGTH                             0x1
#define _LCDDATA20_S23C3_MASK                               0x80

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
extern volatile unsigned char           LCDDATA24           __at(0x1D30);
#ifndef _LIB_BUILD
asm("LCDDATA24 equ 01D30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C4                  :1;
        unsigned S01C4                  :1;
        unsigned S02C4                  :1;
        unsigned S03C4                  :1;
        unsigned S04C4                  :1;
        unsigned                        :1;
        unsigned S06C4                  :1;
        unsigned S07C4                  :1;
    };
} LCDDATA24bits_t;
extern volatile LCDDATA24bits_t LCDDATA24bits __at(0x1D30);
// bitfield macros
#define _LCDDATA24_S00C4_POSN                               0x0
#define _LCDDATA24_S00C4_POSITION                           0x0
#define _LCDDATA24_S00C4_SIZE                               0x1
#define _LCDDATA24_S00C4_LENGTH                             0x1
#define _LCDDATA24_S00C4_MASK                               0x1
#define _LCDDATA24_S01C4_POSN                               0x1
#define _LCDDATA24_S01C4_POSITION                           0x1
#define _LCDDATA24_S01C4_SIZE                               0x1
#define _LCDDATA24_S01C4_LENGTH                             0x1
#define _LCDDATA24_S01C4_MASK                               0x2
#define _LCDDATA24_S02C4_POSN                               0x2
#define _LCDDATA24_S02C4_POSITION                           0x2
#define _LCDDATA24_S02C4_SIZE                               0x1
#define _LCDDATA24_S02C4_LENGTH                             0x1
#define _LCDDATA24_S02C4_MASK                               0x4
#define _LCDDATA24_S03C4_POSN                               0x3
#define _LCDDATA24_S03C4_POSITION                           0x3
#define _LCDDATA24_S03C4_SIZE                               0x1
#define _LCDDATA24_S03C4_LENGTH                             0x1
#define _LCDDATA24_S03C4_MASK                               0x8
#define _LCDDATA24_S04C4_POSN                               0x4
#define _LCDDATA24_S04C4_POSITION                           0x4
#define _LCDDATA24_S04C4_SIZE                               0x1
#define _LCDDATA24_S04C4_LENGTH                             0x1
#define _LCDDATA24_S04C4_MASK                               0x10
#define _LCDDATA24_S06C4_POSN                               0x6
#define _LCDDATA24_S06C4_POSITION                           0x6
#define _LCDDATA24_S06C4_SIZE                               0x1
#define _LCDDATA24_S06C4_LENGTH                             0x1
#define _LCDDATA24_S06C4_MASK                               0x40
#define _LCDDATA24_S07C4_POSN                               0x7
#define _LCDDATA24_S07C4_POSITION                           0x7
#define _LCDDATA24_S07C4_SIZE                               0x1
#define _LCDDATA24_S07C4_LENGTH                             0x1
#define _LCDDATA24_S07C4_MASK                               0x80

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
extern volatile unsigned char           LCDDATA25           __at(0x1D31);
#ifndef _LIB_BUILD
asm("LCDDATA25 equ 01D31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C4                  :1;
        unsigned S09C4                  :1;
        unsigned S10C4                  :1;
        unsigned S11C4                  :1;
        unsigned                        :1;
        unsigned S13C4                  :1;
        unsigned S14C4                  :1;
        unsigned S15C4                  :1;
    };
} LCDDATA25bits_t;
extern volatile LCDDATA25bits_t LCDDATA25bits __at(0x1D31);
// bitfield macros
#define _LCDDATA25_S08C4_POSN                               0x0
#define _LCDDATA25_S08C4_POSITION                           0x0
#define _LCDDATA25_S08C4_SIZE                               0x1
#define _LCDDATA25_S08C4_LENGTH                             0x1
#define _LCDDATA25_S08C4_MASK                               0x1
#define _LCDDATA25_S09C4_POSN                               0x1
#define _LCDDATA25_S09C4_POSITION                           0x1
#define _LCDDATA25_S09C4_SIZE                               0x1
#define _LCDDATA25_S09C4_LENGTH                             0x1
#define _LCDDATA25_S09C4_MASK                               0x2
#define _LCDDATA25_S10C4_POSN                               0x2
#define _LCDDATA25_S10C4_POSITION                           0x2
#define _LCDDATA25_S10C4_SIZE                               0x1
#define _LCDDATA25_S10C4_LENGTH                             0x1
#define _LCDDATA25_S10C4_MASK                               0x4
#define _LCDDATA25_S11C4_POSN                               0x3
#define _LCDDATA25_S11C4_POSITION                           0x3
#define _LCDDATA25_S11C4_SIZE                               0x1
#define _LCDDATA25_S11C4_LENGTH                             0x1
#define _LCDDATA25_S11C4_MASK                               0x8
#define _LCDDATA25_S13C4_POSN                               0x5
#define _LCDDATA25_S13C4_POSITION                           0x5
#define _LCDDATA25_S13C4_SIZE                               0x1
#define _LCDDATA25_S13C4_LENGTH                             0x1
#define _LCDDATA25_S13C4_MASK                               0x20
#define _LCDDATA25_S14C4_POSN                               0x6
#define _LCDDATA25_S14C4_POSITION                           0x6
#define _LCDDATA25_S14C4_SIZE                               0x1
#define _LCDDATA25_S14C4_LENGTH                             0x1
#define _LCDDATA25_S14C4_MASK                               0x40
#define _LCDDATA25_S15C4_POSN                               0x7
#define _LCDDATA25_S15C4_POSITION                           0x7
#define _LCDDATA25_S15C4_SIZE                               0x1
#define _LCDDATA25_S15C4_LENGTH                             0x1
#define _LCDDATA25_S15C4_MASK                               0x80

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
extern volatile unsigned char           LCDDATA26           __at(0x1D32);
#ifndef _LIB_BUILD
asm("LCDDATA26 equ 01D32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C4                  :1;
        unsigned S19C4                  :1;
        unsigned S20C4                  :1;
        unsigned                        :1;
        unsigned S22C4                  :1;
        unsigned S23C4                  :1;
    };
} LCDDATA26bits_t;
extern volatile LCDDATA26bits_t LCDDATA26bits __at(0x1D32);
// bitfield macros
#define _LCDDATA26_S18C4_POSN                               0x2
#define _LCDDATA26_S18C4_POSITION                           0x2
#define _LCDDATA26_S18C4_SIZE                               0x1
#define _LCDDATA26_S18C4_LENGTH                             0x1
#define _LCDDATA26_S18C4_MASK                               0x4
#define _LCDDATA26_S19C4_POSN                               0x3
#define _LCDDATA26_S19C4_POSITION                           0x3
#define _LCDDATA26_S19C4_SIZE                               0x1
#define _LCDDATA26_S19C4_LENGTH                             0x1
#define _LCDDATA26_S19C4_MASK                               0x8
#define _LCDDATA26_S20C4_POSN                               0x4
#define _LCDDATA26_S20C4_POSITION                           0x4
#define _LCDDATA26_S20C4_SIZE                               0x1
#define _LCDDATA26_S20C4_LENGTH                             0x1
#define _LCDDATA26_S20C4_MASK                               0x10
#define _LCDDATA26_S22C4_POSN                               0x6
#define _LCDDATA26_S22C4_POSITION                           0x6
#define _LCDDATA26_S22C4_SIZE                               0x1
#define _LCDDATA26_S22C4_LENGTH                             0x1
#define _LCDDATA26_S22C4_MASK                               0x40
#define _LCDDATA26_S23C4_POSN                               0x7
#define _LCDDATA26_S23C4_POSITION                           0x7
#define _LCDDATA26_S23C4_SIZE                               0x1
#define _LCDDATA26_S23C4_LENGTH                             0x1
#define _LCDDATA26_S23C4_MASK                               0x80

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
extern volatile unsigned char           LCDDATA30           __at(0x1D36);
#ifndef _LIB_BUILD
asm("LCDDATA30 equ 01D36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C5                  :1;
        unsigned S01C5                  :1;
        unsigned S02C5                  :1;
        unsigned S03C5                  :1;
        unsigned S04C5                  :1;
        unsigned                        :1;
        unsigned S06C5                  :1;
        unsigned S07C5                  :1;
    };
} LCDDATA30bits_t;
extern volatile LCDDATA30bits_t LCDDATA30bits __at(0x1D36);
// bitfield macros
#define _LCDDATA30_S00C5_POSN                               0x0
#define _LCDDATA30_S00C5_POSITION                           0x0
#define _LCDDATA30_S00C5_SIZE                               0x1
#define _LCDDATA30_S00C5_LENGTH                             0x1
#define _LCDDATA30_S00C5_MASK                               0x1
#define _LCDDATA30_S01C5_POSN                               0x1
#define _LCDDATA30_S01C5_POSITION                           0x1
#define _LCDDATA30_S01C5_SIZE                               0x1
#define _LCDDATA30_S01C5_LENGTH                             0x1
#define _LCDDATA30_S01C5_MASK                               0x2
#define _LCDDATA30_S02C5_POSN                               0x2
#define _LCDDATA30_S02C5_POSITION                           0x2
#define _LCDDATA30_S02C5_SIZE                               0x1
#define _LCDDATA30_S02C5_LENGTH                             0x1
#define _LCDDATA30_S02C5_MASK                               0x4
#define _LCDDATA30_S03C5_POSN                               0x3
#define _LCDDATA30_S03C5_POSITION                           0x3
#define _LCDDATA30_S03C5_SIZE                               0x1
#define _LCDDATA30_S03C5_LENGTH                             0x1
#define _LCDDATA30_S03C5_MASK                               0x8
#define _LCDDATA30_S04C5_POSN                               0x4
#define _LCDDATA30_S04C5_POSITION                           0x4
#define _LCDDATA30_S04C5_SIZE                               0x1
#define _LCDDATA30_S04C5_LENGTH                             0x1
#define _LCDDATA30_S04C5_MASK                               0x10
#define _LCDDATA30_S06C5_POSN                               0x6
#define _LCDDATA30_S06C5_POSITION                           0x6
#define _LCDDATA30_S06C5_SIZE                               0x1
#define _LCDDATA30_S06C5_LENGTH                             0x1
#define _LCDDATA30_S06C5_MASK                               0x40
#define _LCDDATA30_S07C5_POSN                               0x7
#define _LCDDATA30_S07C5_POSITION                           0x7
#define _LCDDATA30_S07C5_SIZE                               0x1
#define _LCDDATA30_S07C5_LENGTH                             0x1
#define _LCDDATA30_S07C5_MASK                               0x80

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
extern volatile unsigned char           LCDDATA31           __at(0x1D37);
#ifndef _LIB_BUILD
asm("LCDDATA31 equ 01D37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C5                  :1;
        unsigned S09C5                  :1;
        unsigned S10C5                  :1;
        unsigned S11C5                  :1;
        unsigned                        :1;
        unsigned S13C5                  :1;
        unsigned S14C5                  :1;
        unsigned S15C5                  :1;
    };
} LCDDATA31bits_t;
extern volatile LCDDATA31bits_t LCDDATA31bits __at(0x1D37);
// bitfield macros
#define _LCDDATA31_S08C5_POSN                               0x0
#define _LCDDATA31_S08C5_POSITION                           0x0
#define _LCDDATA31_S08C5_SIZE                               0x1
#define _LCDDATA31_S08C5_LENGTH                             0x1
#define _LCDDATA31_S08C5_MASK                               0x1
#define _LCDDATA31_S09C5_POSN                               0x1
#define _LCDDATA31_S09C5_POSITION                           0x1
#define _LCDDATA31_S09C5_SIZE                               0x1
#define _LCDDATA31_S09C5_LENGTH                             0x1
#define _LCDDATA31_S09C5_MASK                               0x2
#define _LCDDATA31_S10C5_POSN                               0x2
#define _LCDDATA31_S10C5_POSITION                           0x2
#define _LCDDATA31_S10C5_SIZE                               0x1
#define _LCDDATA31_S10C5_LENGTH                             0x1
#define _LCDDATA31_S10C5_MASK                               0x4
#define _LCDDATA31_S11C5_POSN                               0x3
#define _LCDDATA31_S11C5_POSITION                           0x3
#define _LCDDATA31_S11C5_SIZE                               0x1
#define _LCDDATA31_S11C5_LENGTH                             0x1
#define _LCDDATA31_S11C5_MASK                               0x8
#define _LCDDATA31_S13C5_POSN                               0x5
#define _LCDDATA31_S13C5_POSITION                           0x5
#define _LCDDATA31_S13C5_SIZE                               0x1
#define _LCDDATA31_S13C5_LENGTH                             0x1
#define _LCDDATA31_S13C5_MASK                               0x20
#define _LCDDATA31_S14C5_POSN                               0x6
#define _LCDDATA31_S14C5_POSITION                           0x6
#define _LCDDATA31_S14C5_SIZE                               0x1
#define _LCDDATA31_S14C5_LENGTH                             0x1
#define _LCDDATA31_S14C5_MASK                               0x40
#define _LCDDATA31_S15C5_POSN                               0x7
#define _LCDDATA31_S15C5_POSITION                           0x7
#define _LCDDATA31_S15C5_SIZE                               0x1
#define _LCDDATA31_S15C5_LENGTH                             0x1
#define _LCDDATA31_S15C5_MASK                               0x80

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
extern volatile unsigned char           LCDDATA32           __at(0x1D38);
#ifndef _LIB_BUILD
asm("LCDDATA32 equ 01D38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C5                  :1;
        unsigned S19C5                  :1;
        unsigned S20C5                  :1;
        unsigned                        :1;
        unsigned S22C5                  :1;
        unsigned S23C5                  :1;
    };
} LCDDATA32bits_t;
extern volatile LCDDATA32bits_t LCDDATA32bits __at(0x1D38);
// bitfield macros
#define _LCDDATA32_S18C5_POSN                               0x2
#define _LCDDATA32_S18C5_POSITION                           0x2
#define _LCDDATA32_S18C5_SIZE                               0x1
#define _LCDDATA32_S18C5_LENGTH                             0x1
#define _LCDDATA32_S18C5_MASK                               0x4
#define _LCDDATA32_S19C5_POSN                               0x3
#define _LCDDATA32_S19C5_POSITION                           0x3
#define _LCDDATA32_S19C5_SIZE                               0x1
#define _LCDDATA32_S19C5_LENGTH                             0x1
#define _LCDDATA32_S19C5_MASK                               0x8
#define _LCDDATA32_S20C5_POSN                               0x4
#define _LCDDATA32_S20C5_POSITION                           0x4
#define _LCDDATA32_S20C5_SIZE                               0x1
#define _LCDDATA32_S20C5_LENGTH                             0x1
#define _LCDDATA32_S20C5_MASK                               0x10
#define _LCDDATA32_S22C5_POSN                               0x6
#define _LCDDATA32_S22C5_POSITION                           0x6
#define _LCDDATA32_S22C5_SIZE                               0x1
#define _LCDDATA32_S22C5_LENGTH                             0x1
#define _LCDDATA32_S22C5_MASK                               0x40
#define _LCDDATA32_S23C5_POSN                               0x7
#define _LCDDATA32_S23C5_POSITION                           0x7
#define _LCDDATA32_S23C5_SIZE                               0x1
#define _LCDDATA32_S23C5_LENGTH                             0x1
#define _LCDDATA32_S23C5_MASK                               0x80

