MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19155/mcu.h
extern volatile LCDDATA38bits_t LCDDATA38bits __at(0x1D3E);
// bitfield macros
#define _LCDDATA38_S18C6_POSN                               0x2
#define _LCDDATA38_S18C6_POSITION                           0x2
#define _LCDDATA38_S18C6_SIZE                               0x1
#define _LCDDATA38_S18C6_LENGTH                             0x1
#define _LCDDATA38_S18C6_MASK                               0x4
#define _LCDDATA38_S19C6_POSN                               0x3
#define _LCDDATA38_S19C6_POSITION                           0x3
#define _LCDDATA38_S19C6_SIZE                               0x1
#define _LCDDATA38_S19C6_LENGTH                             0x1
#define _LCDDATA38_S19C6_MASK                               0x8
#define _LCDDATA38_S20C6_POSN                               0x4
#define _LCDDATA38_S20C6_POSITION                           0x4
#define _LCDDATA38_S20C6_SIZE                               0x1
#define _LCDDATA38_S20C6_LENGTH                             0x1
#define _LCDDATA38_S20C6_MASK                               0x10
#define _LCDDATA38_S22C6_POSN                               0x6
#define _LCDDATA38_S22C6_POSITION                           0x6
#define _LCDDATA38_S22C6_SIZE                               0x1
#define _LCDDATA38_S22C6_LENGTH                             0x1
#define _LCDDATA38_S22C6_MASK                               0x40
#define _LCDDATA38_S23C6_POSN                               0x7
#define _LCDDATA38_S23C6_POSITION                           0x7
#define _LCDDATA38_S23C6_SIZE                               0x1
#define _LCDDATA38_S23C6_LENGTH                             0x1
#define _LCDDATA38_S23C6_MASK                               0x80

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
extern volatile unsigned char           LCDDATA42           __at(0x1D42);
#ifndef _LIB_BUILD
asm("LCDDATA42 equ 01D42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C7                  :1;
        unsigned S01C7                  :1;
        unsigned S02C7                  :1;
        unsigned S03C7                  :1;
        unsigned S04C7                  :1;
        unsigned                        :1;
        unsigned S06C7                  :1;
        unsigned S07C7                  :1;
    };
} LCDDATA42bits_t;
extern volatile LCDDATA42bits_t LCDDATA42bits __at(0x1D42);
// bitfield macros
#define _LCDDATA42_S00C7_POSN                               0x0
#define _LCDDATA42_S00C7_POSITION                           0x0
#define _LCDDATA42_S00C7_SIZE                               0x1
#define _LCDDATA42_S00C7_LENGTH                             0x1
#define _LCDDATA42_S00C7_MASK                               0x1
#define _LCDDATA42_S01C7_POSN                               0x1
#define _LCDDATA42_S01C7_POSITION                           0x1
#define _LCDDATA42_S01C7_SIZE                               0x1
#define _LCDDATA42_S01C7_LENGTH                             0x1
#define _LCDDATA42_S01C7_MASK                               0x2
#define _LCDDATA42_S02C7_POSN                               0x2
#define _LCDDATA42_S02C7_POSITION                           0x2
#define _LCDDATA42_S02C7_SIZE                               0x1
#define _LCDDATA42_S02C7_LENGTH                             0x1
#define _LCDDATA42_S02C7_MASK                               0x4
#define _LCDDATA42_S03C7_POSN                               0x3
#define _LCDDATA42_S03C7_POSITION                           0x3
#define _LCDDATA42_S03C7_SIZE                               0x1
#define _LCDDATA42_S03C7_LENGTH                             0x1
#define _LCDDATA42_S03C7_MASK                               0x8
#define _LCDDATA42_S04C7_POSN                               0x4
#define _LCDDATA42_S04C7_POSITION                           0x4
#define _LCDDATA42_S04C7_SIZE                               0x1
#define _LCDDATA42_S04C7_LENGTH                             0x1
#define _LCDDATA42_S04C7_MASK                               0x10
#define _LCDDATA42_S06C7_POSN                               0x6
#define _LCDDATA42_S06C7_POSITION                           0x6
#define _LCDDATA42_S06C7_SIZE                               0x1
#define _LCDDATA42_S06C7_LENGTH                             0x1
#define _LCDDATA42_S06C7_MASK                               0x40
#define _LCDDATA42_S07C7_POSN                               0x7
#define _LCDDATA42_S07C7_POSITION                           0x7
#define _LCDDATA42_S07C7_SIZE                               0x1
#define _LCDDATA42_S07C7_LENGTH                             0x1
#define _LCDDATA42_S07C7_MASK                               0x80

// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
extern volatile unsigned char           LCDDATA43           __at(0x1D43);
#ifndef _LIB_BUILD
asm("LCDDATA43 equ 01D43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C7                  :1;
        unsigned S09C7                  :1;
        unsigned S10C7                  :1;
        unsigned S11C7                  :1;
        unsigned                        :1;
        unsigned S13C7                  :1;
        unsigned S14C7                  :1;
        unsigned S15C7                  :1;
    };
} LCDDATA43bits_t;
extern volatile LCDDATA43bits_t LCDDATA43bits __at(0x1D43);
// bitfield macros
#define _LCDDATA43_S08C7_POSN                               0x0
#define _LCDDATA43_S08C7_POSITION                           0x0
#define _LCDDATA43_S08C7_SIZE                               0x1
#define _LCDDATA43_S08C7_LENGTH                             0x1
#define _LCDDATA43_S08C7_MASK                               0x1
#define _LCDDATA43_S09C7_POSN                               0x1
#define _LCDDATA43_S09C7_POSITION                           0x1
#define _LCDDATA43_S09C7_SIZE                               0x1
#define _LCDDATA43_S09C7_LENGTH                             0x1
#define _LCDDATA43_S09C7_MASK                               0x2
#define _LCDDATA43_S10C7_POSN                               0x2
#define _LCDDATA43_S10C7_POSITION                           0x2
#define _LCDDATA43_S10C7_SIZE                               0x1
#define _LCDDATA43_S10C7_LENGTH                             0x1
#define _LCDDATA43_S10C7_MASK                               0x4
#define _LCDDATA43_S11C7_POSN                               0x3
#define _LCDDATA43_S11C7_POSITION                           0x3
#define _LCDDATA43_S11C7_SIZE                               0x1
#define _LCDDATA43_S11C7_LENGTH                             0x1
#define _LCDDATA43_S11C7_MASK                               0x8
#define _LCDDATA43_S13C7_POSN                               0x5
#define _LCDDATA43_S13C7_POSITION                           0x5
#define _LCDDATA43_S13C7_SIZE                               0x1
#define _LCDDATA43_S13C7_LENGTH                             0x1
#define _LCDDATA43_S13C7_MASK                               0x20
#define _LCDDATA43_S14C7_POSN                               0x6
#define _LCDDATA43_S14C7_POSITION                           0x6
#define _LCDDATA43_S14C7_SIZE                               0x1
#define _LCDDATA43_S14C7_LENGTH                             0x1
#define _LCDDATA43_S14C7_MASK                               0x40
#define _LCDDATA43_S15C7_POSN                               0x7
#define _LCDDATA43_S15C7_POSITION                           0x7
#define _LCDDATA43_S15C7_SIZE                               0x1
#define _LCDDATA43_S15C7_LENGTH                             0x1
#define _LCDDATA43_S15C7_MASK                               0x80

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
extern volatile unsigned char           LCDDATA44           __at(0x1D44);
#ifndef _LIB_BUILD
asm("LCDDATA44 equ 01D44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C7                  :1;
        unsigned S19C7                  :1;
        unsigned S20C7                  :1;
        unsigned                        :1;
        unsigned S22C7                  :1;
        unsigned S23C7                  :1;
    };
} LCDDATA44bits_t;
